; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v7 - type_3 ?v6 - type_1)
 	      (pred_1 ?v4 - object ?v6 - type_1)
	      (pred_4 ?v7 - type_3 ?v1 - type_2)
	      (pred_3 ?v7 - type_3 ?v4 - object ?v1 - type_2))

   (:action op_3
       :parameters  (?v7 - type_3 ?v8 ?v3 - type_1)
       :precondition (and  (pred_2 ?v7 ?v8))
       :effect (and  (pred_2 ?v7 ?v3)
		     (not (pred_2 ?v7 ?v8))))

   (:action op_1
       :parameters (?v7 - type_3 ?v5 - object ?v2 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v5 ?v2) (pred_2 ?v7 ?v2) (pred_4 ?v7 ?v1))
       :effect (and (pred_3 ?v7 ?v5 ?v1)
		    (not (pred_1 ?v5 ?v2)) 
		    (not (pred_4 ?v7 ?v1))))

   (:action op_2
       :parameters (?v7 - type_3 ?v5 - object ?v2 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_3 ?v7 ?v5 ?v1) (pred_2 ?v7 ?v2))
       :effect (and (pred_1 ?v5 ?v2)
		    (pred_4 ?v7 ?v1)
		    (not (pred_3 ?v7 ?v5 ?v1)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_09 obj_05 - type_3
obj_02 obj_01 obj_11 obj_06 - type_2
obj_04 obj_08 obj_03 - type_1
obj_10 obj_07 - object)
(:init
(pred_2 obj_09 obj_08)
(pred_4 obj_09 obj_02)
(pred_4 obj_09 obj_01)
(pred_2 obj_05 obj_08)
(pred_4 obj_05 obj_11)
(pred_4 obj_05 obj_06)
(pred_1 obj_10 obj_08)
(pred_1 obj_07 obj_03)
)
(:goal
(and
(pred_1 obj_10 obj_03)
(pred_1 obj_07 obj_08)
)
)

(:constraints
  (always (not (pred_2 obj_09 obj_03)))
)
)

; plan
1. (op_1 obj_09 obj_10 obj_08 obj_01)
   deleted: (pred_1 obj_10 obj_08) (pred_4 obj_09 obj_01)
   added: (pred_3 obj_09 obj_10 obj_01)
   goals met: 0 of 2
2. (op_3 obj_05 obj_08 obj_03)
   deleted: (pred_2 obj_05 obj_08)
   added: (pred_2 obj_05 obj_03)
   goals met: 0 of 2
3. (op_1 obj_05 obj_07 obj_03 obj_06)
   deleted: (pred_1 obj_07 obj_03) (pred_4 obj_05 obj_06)
   added: (pred_3 obj_05 obj_07 obj_06)
   goals met: 0 of 2
4. (op_3 obj_05 obj_03 obj_08)
   deleted: (pred_2 obj_05 obj_03)
   added: (pred_2 obj_05 obj_08)
   goals met: 0 of 2
5. (op_2 obj_05 obj_07 obj_08 obj_06)
   deleted: (pred_3 obj_05 obj_07 obj_06)
   added: (pred_1 obj_07 obj_08) (pred_4 obj_05 obj_06)
   goals met: 1 of 2
6. (op_2 obj_09 obj_10 obj_08 obj_01)
   deleted: (pred_3 obj_09 obj_10 obj_01)
   added: (pred_1 obj_10 obj_08) (pred_4 obj_09 obj_01)
   goals met: 1 of 2
7. (op_1 obj_05 obj_10 obj_08 obj_06)
   deleted: (pred_1 obj_10 obj_08) (pred_4 obj_05 obj_06)
   added: (pred_3 obj_05 obj_10 obj_06)
   goals met: 1 of 2
8. (op_3 obj_05 obj_08 obj_03)
   deleted: (pred_2 obj_05 obj_08)
   added: (pred_2 obj_05 obj_03)
   goals met: 1 of 2
9. (op_2 obj_05 obj_10 obj_03 obj_06)
   deleted: (pred_3 obj_05 obj_10 obj_06)
   added: (pred_1 obj_10 obj_03) (pred_4 obj_05 obj_06)
   goals met: 2 of 2
